<a href="https://colab.research.google.com/github/MavrellousG/DFE_py_Analytics/blob/main/TextAnalysisRegex.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Exploratory Text Analysis

## What kinds of text analysis are there?

* analyst knows the pattern
    * regular expressions
* analyst does not know the pattern
    * natural language processing
        * compares historical examples to judge novel cases
            * comparisons are statistical and approximate

### Examples of Analysis

When you know the pattern:

In [16]:
pattern = '£ ?[0-9][0-9]?' # £ then SPACE-optional then digit then digit-optional 

document = 'My eggs cost £3, bread cost £2, vodka cost £35'

In [17]:
import re

In [18]:
re.findall(pattern, document)

['£3', '£2', '£35']

If you dont:

* sentiment analysis
    * how positive/negative is this (new) review?
* topic analysis 
    * what is this document about?

## What can I do if I know what pattern I want to find?

* finding ("extracting")
    * what matches the pattern?
* matching ("validating")
    * does the entire document match YES/NO?
* substitue ("replacing")
    * replace a part that matches a pattern with another...

## How do I validate text with pandas?

In [19]:
import pandas as pd

In [57]:
ti = pd.read_csv('titanic.csv')
ti.sample(891)

     survived  pclass     sex   age  ...  deck  embark_town  alive  alone
677         1       3  female  18.0  ...   NaN  Southampton    yes   True
555         0       1    male  62.0  ...   NaN  Southampton     no   True
484         1       1    male  25.0  ...     B    Cherbourg    yes  False
46          0       3    male   NaN  ...   NaN   Queenstown     no  False
277         0       2    male   NaN  ...   NaN  Southampton     no   True
..        ...     ...     ...   ...  ...   ...          ...    ...    ...
184         1       3  female   4.0  ...   NaN  Southampton    yes  False
378         0       3    male  20.0  ...   NaN    Cherbourg     no   True
452         0       1    male  30.0  ...     C    Cherbourg     no   True
446         1       2  female  13.0  ...   NaN  Southampton    yes  False
299         1       1  female  50.0  ...     B    Cherbourg    yes  False

[891 rows x 15 columns]

In [58]:
ti['ticket'] = "Ticket: " + ti['class'] + "; Price: $ " + ti['fare'].astype(str) + "; Port: " + ti['embark_town'] + ";"

In [59]:
ti[['class', 'fare', 'embark_town', 'ticket']].tail(10)

      class  ...                                             ticket
881   Third  ...  Ticket: Third; Price: $ 7.8958; Port: Southamp...
882   Third  ...  Ticket: Third; Price: $ 10.5167; Port: Southam...
883  Second  ...  Ticket: Second; Price: $ 10.5; Port: Southampton;
884   Third  ...   Ticket: Third; Price: $ 7.05; Port: Southampton;
885   Third  ...  Ticket: Third; Price: $ 29.125; Port: Queenstown;
886  Second  ...  Ticket: Second; Price: $ 13.0; Port: Southampton;
887   First  ...   Ticket: First; Price: $ 30.0; Port: Southampton;
888   Third  ...  Ticket: Third; Price: $ 23.45; Port: Southampton;
889   First  ...     Ticket: First; Price: $ 30.0; Port: Cherbourg;
890   Third  ...    Ticket: Third; Price: $ 7.75; Port: Queenstown;

[10 rows x 4 columns]

In [60]:
pattern = '(First|Second)'

ti['class'].str.match(pattern)

0      False
1       True
2      False
3       True
4      False
       ...
886     True
887     True
888    False
889     True
890    False
Name: class, Length: 891, dtype: bool

In [61]:
ti.loc[ ti['class'].str.match(pattern)  , 'survived'].mean()

0.5575

In [62]:
pattern2 = '(Second|Third)'

ti['class'].str.match(pattern2)

0       True
1      False
2       True
3      False
4       True
       ...
886     True
887    False
888     True
889    False
890     True
Name: class, Length: 891, dtype: bool

In [63]:
ti.loc[ ti['class'].str.match(pattern2)  , 'survived'].mean()

0.30518518518518517

In [65]:
pattern3 = '(First|Third)'

ti['class'].str.match(pattern3)

0       True
1       True
2       True
3       True
4       True
       ...
886    False
887     True
888     True
889     True
890     True
Name: class, Length: 891, dtype: bool

In [66]:
ti.loc[ ti['class'].str.match(pattern3)  , 'survived'].mean()

0.3606789250353607

## How do I extract data with pandas?

In [25]:
ti[['class', 'fare', 'embark_town', 'ticket']].head(3)

   class  ...                                             ticket
0  Third  ...   Ticket: Third; Price: $ 7.25; Port: Southampton;
1  First  ...  Ticket: First; Price: $ 71.2833; Port: Cherbourg;
2  Third  ...  Ticket: Third; Price: $ 7.925; Port: Southampton;

[3 rows x 4 columns]

In [26]:
pattern = '([0-9.]+)'

ti['ticket'].str.extract(pattern).sample(4)

          0
491    7.25
138  9.2167
92   61.175
264    7.75

## How do I substitue text with pandas?

In [27]:
ti['ticket'].str.replace('$', '€').sample(1)

697    Ticket: Third; Price: € 7.7333; Port: Queenstown;
Name: ticket, dtype: object

## What are regular expressions?

Regular expressions are a language for describing patterns in text. 

They are separate from python, but may be used within python program. (And elsewhere, eg., often in SQL). 

They are notoriously difficult to read and write; and as a separate language, an additional tool to learn.

## What regular expression patterns can I use?

* literals
    * `a`, find me an `a`
    * `£`, find `£`
    * `!` means `!` 
    * ... most symbols mean "find me"
* `.`
    * find any **single** symbol 
* character classes -- find a **single** symbol
    * `[abc]` $\rightarrow$ **either** a, b, c
    * `[0-9]` $\rightarrow$ **either** 0, 1, 2, 3,...9
    * `[A-Z]` $\rightarrow$ **either** capital A, B, ... Z
    * inversions
        * `[^abc]` $\rightarrow$ **is not** `a` OR `b` OR `c`
        * `[^a-zA-Z0-9 ]`  $\rightarrow$ **is not** alphanumeric-ish
    
* alternatives -- find the character**s** given by...
    * `(May|June|July)`  $\rightarrow$ **the whole worlds** May OR June..

In [28]:
ti['ticket'].str.extract('(Ticket: (First|Second))')

                  0       1
0               NaN     NaN
1     Ticket: First   First
2               NaN     NaN
3     Ticket: First   First
4               NaN     NaN
..              ...     ...
886  Ticket: Second  Second
887   Ticket: First   First
888             NaN     NaN
889   Ticket: First   First
890             NaN     NaN

[891 rows x 2 columns]

In [29]:
ti['ticket'].str.extract('( [0-9][0-9])')

       0
0    NaN
1     71
2    NaN
3     53
4    NaN
..   ...
886   13
887   30
888   23
889   30
890  NaN

[891 rows x 1 columns]

In [30]:
ti['ticket'].sample(1)

800    Ticket: Second; Price: $ 13.0; Port: Southampton;
Name: ticket, dtype: object

In [67]:
ti['ticket'].str.extract('(Ticket: [A-Z])').sample(20)

             0
232  Ticket: S
91   Ticket: T
339  Ticket: F
171  Ticket: T
335  Ticket: T
612  Ticket: T
597  Ticket: T
251  Ticket: T
381  Ticket: T
377  Ticket: F
165  Ticket: T
283  Ticket: T
8    Ticket: T
875  Ticket: T
125  Ticket: T
120  Ticket: S
43   Ticket: S
659  Ticket: F
726  Ticket: S
319  Ticket: F

In [32]:
ti['ticket'].str.extract('(T........)').sample(3)

             0
283  Ticket: T
713  Ticket: T
35   Ticket: F

In [68]:
ti['ticket'].str.extract('(Price: [^0-9A-Za-z] ..)').sample(300)

               0
9    Price: $ 30
610  Price: $ 31
602  Price: $ 42
176  Price: $ 25
77   Price: $ 8.
..           ...
451  Price: $ 19
780  Price: $ 7.
689  Price: $ 21
655  Price: $ 73
478  Price: $ 7.

[300 rows x 1 columns]

In [34]:
ti['ticket'].str.extract('(Port: (Cherbourg|Southampton))').sample(3)

                     0            1
427  Port: Southampton  Southampton
374  Port: Southampton  Southampton
884  Port: Southampton  Southampton

* repetitions
    * optional `?`
        * an optional number: `[0-9]?`
    * one or more `+`
        * one or more spaces: ` +`  
    * optional, or more, `*`
        * ` [0-9][0-9]?.[0-9]*`

In [35]:
ti['ticket'].str.extract('([0-9][0-9]?.[0-9]*)').sample(3)

          0
332     153
71     46.9
623  7.8542

In [36]:
ti['ticket'].str.extract('(Ticket: [a-zA-Z]+)').sample(3)

                  0
726  Ticket: Second
433   Ticket: Third
412   Ticket: First

In [37]:
row = 0
match = 1 # second match

ti['ticket'].str.extractall('([a-zA-Z]+: [a-zA-Z]+)').loc[row, match]

0    Port: Southampton
Name: (0, 1), dtype: object

In [38]:
ti['ticket'].str.extract('([a-zA-Z]+tow?n)')

               0
0    Southampton
1            NaN
2    Southampton
3    Southampton
4    Southampton
..           ...
886  Southampton
887  Southampton
888  Southampton
889          NaN
890   Queenstown

[891 rows x 1 columns]

* EXTRA: 
    * escaping
        * How do I say, literally, the `.` symbol?
        * `\.`

In [39]:
ti['ticket'].str.extract('(\$ [0-9]+\.[0-9]+)').sample(2)

           0
55    $ 35.5
667  $ 7.775

* positional matching
    * `^` means **at the beginning**
    * `$` means **at the end**

In [40]:
ti['ticket'].str.extractall('([a-zA-Z]+: [a-zA-Z]+;$)').sample(1)

                          0
    match
452 0      Port: Cherbourg;

In [41]:
ti['ticket'].str.extractall('(^[a-zA-Z]+: [a-zA-Z]+;)').sample(1)

                        0
    match
295 0      Ticket: First;

## Next Steps

* review a "Regex Cheat Sheet"
    * also, eg., https://en.wikipedia.org/wiki/Regular_expression#Examples

## Exercise (30 min)

* find all the words in the tickets 
    * HINT: a word is a repeated letter followed by a space or a colon
    * HINT: `[ :]` means a space or a colon
* find all the USD prices
    * HINT: ``` \$ ``` and repeated numbers 
    
* find all the high-price tickets
    * HINT: consider `\$`, tripple-digit number, `\.`

In [69]:
#Solution find all the words in the tickets

In [79]:
#or
#ti['ticket'].str.findall('([a-zA-Z]*[ :])').sample(810)#for Zero or more occurrences
ti['ticket'].str.findall('([a-zA-Z]+[ :])').sample(810) #	One or more occurrences

341    [Ticket:, Price:, Port:]
718    [Ticket:, Price:, Port:]
54     [Ticket:, Price:, Port:]
327    [Ticket:, Price:, Port:]
310    [Ticket:, Price:, Port:]
                 ...
797    [Ticket:, Price:, Port:]
206    [Ticket:, Price:, Port:]
836    [Ticket:, Price:, Port:]
76     [Ticket:, Price:, Port:]
468    [Ticket:, Price:, Port:]
Name: ticket, Length: 810, dtype: object

In [ ]:
#Solution find all the USD prices

In [80]:
#or
#ti['ticket'].str.extract('(\$ [0-9]+\.[0-9]+)').sample(800) #with decimals
ti['ticket'].str.extract('(\$ [0-9]+)').sample(800)

         0
564    $ 8
851    $ 7
166   $ 55
827   $ 37
629    $ 7
..     ...
57     $ 7
97    $ 63
177   $ 28
473   $ 13
708  $ 151

[800 rows x 1 columns]

In [ ]:
#Solution find all the high-price tickets

In [81]:
row = 0
match = 1 # second match
#or
#ti['ticket'].str.extractall('(\$ [0-9][0-9][0-9]+\.[0-9]+)')#.loc[row, 0] # samething
ti['ticket'].str.extractall('(\$ [0-9]{3})')#.loc[row, 0] # more efficient using {} 	Exactly the specified number of occurrences

               0
    match
27  0      $ 263
31  0      $ 146
88  0      $ 263
118 0      $ 247
195 0      $ 146
215 0      $ 113
258 0      $ 512
268 0      $ 153
269 0      $ 135
297 0      $ 151
299 0      $ 247
305 0      $ 151
306 0      $ 110
307 0      $ 108
311 0      $ 262
318 0      $ 164
319 0      $ 134
325 0      $ 135
332 0      $ 153
334 0      $ 133
337 0      $ 134
341 0      $ 263
373 0      $ 135
377 0      $ 211
380 0      $ 227
390 0      $ 120
393 0      $ 113
435 0      $ 120
438 0      $ 263
498 0      $ 151
505 0      $ 108
527 0      $ 221
537 0      $ 106
544 0      $ 106
550 0      $ 110
557 0      $ 227
581 0      $ 110
609 0      $ 153
659 0      $ 113
660 0      $ 133
679 0      $ 512
689 0      $ 211
698 0      $ 110
700 0      $ 227
708 0      $ 151
716 0      $ 227
730 0      $ 211
737 0      $ 512
742 0      $ 262
763 0      $ 120
779 0      $ 211
802 0      $ 120
856 0      $ 164